full_instructions = [
    {
      "category": "Введение в MetaMask",
      "title": "Что такое MetaMask?",
      "content": ["""
MetaMask — это популярный криптовалютный кошелек, который функционирует как расширение для браузера и мобильное приложение. Он позволяет пользователям взаимодействовать с блокчейном Ethereum и децентрализованными приложениями (dApps), обеспечивая простой доступ к управлению криптовалютами и токенами. MetaMask стал одним из самых популярных кошельков в криптовалютном пространстве благодаря своей функциональности и удобству использования. Он предоставляет пользователям возможность легко управлять своими активами, взаимодействовать с dApps и использовать различные сети блокчейна. Благодаря поддержке множества токенов и сетей, MetaMask подходит как для начинающих пользователей, так и для профессионалов в области криптовалют.

Основные возможности MetaMask

1. Управление криптовалютами
   - Поддержка Ethereum (ETH) и всех токенов стандарта ERC-20
   - Возможность добавления пользовательских токенов через адрес смарт-контракта

2. Подключение к dApps
   - Упрощенное взаимодействие с децентрализованными приложениями, такими как DeFi-платформы и NFT-маркеты

3. Безопасность
   - Приватные ключи хранятся локально на устройстве пользователя, что обеспечивает контроль над средствами
   - Генерация фразы восстановления из 12 слов для восстановления доступа к кошельку

4. Функции обмена
   - Встроенный агрегатор обменов, который позволяет пользователям обменивать токены по лучшим курсам с различных децентрализованных бирж (DEX)

5. Поддержка нескольких сетей
   - Изначально созданный для работы с сетью Ethereum, MetaMask поддерживает также другие сети, совместимые с виртуальной машиной Ethereum (EVM)

Поддерживаемые сети и токены

MetaMask поддерживает множество сетей, что позволяет пользователям работать с различными стандартами токенов:

- Ethereum Mainnet: Основная сеть для токенов ERC-20
- Binance Smart Chain (BSC): Поддержка токенов BEP-20
- Polygon (MATIC): Подключение к сети Polygon для быстрого и дешевле транзакций
- Avalanche: Поддержка сети Avalanche для работы с ее токенами
- Arbitrum и Optimism: Сети второго уровня для снижения нагрузки на Ethereum
- Moonriver: Поддержка этой сети для работы с соответствующими токенами

Преимущества использования MetaMask

- Простота использования: Интуитивно понятный интерфейс делает его доступным как для новичков, так и для опытных пользователей
- Мобильное приложение: Доступно для iOS и Android, что позволяет управлять активами на ходу
- Поддержка NFT: Возможность хранения и управления невзаимозаменяемыми токенами (NFT)
"""]
    },
    {
      "category": "Установка и настройка",
      "title": "Как установить MetaMask?",
      "content": ["""
Установка расширения MetaMask

MetaMask имеет расширение для Google Chrome, Firefox, Opera и Brave. Чтобы установить расширение, необходимо выполнить следующие шаги:

1. Откройте официальный сайт кошелька MetaMask по адресу https://metamask.io/download/.
2. Выберите удобный браузер для использования кошелька внизу страницы.
3. Нажмите на кнопку «Установите MetaMask для Chrome» (или другой выбранный браузер).
4. Следующий шаг — установка расширения для браузера. Нажмите кнопку «Установить расширение».
5. Расширение MetaMask установлено в ваш браузер, поздравляем! Далее необходимо нажать на значок MetaMask в правом верхнем углу на панели браузера, и перед вами откроется новая страница.
6. Поздравляем! Теперь вы можете начать работу с кошельком с панели расширений вашего браузера.

Установка мобильного приложения MetaMask

Кошелек MetaMask также может использоваться на мобильных устройствах с операционной системой iOS или Android. Рассмотрим последовательность действий, которую нужно выполнить для установки мобильного приложения:

1. Перейдите на официальный сайт https://metamask.io и найдите ссылки на скачивание приложения для Android и iOS.
2. Скачайте приложение MetaMask из официального магазина Google Play или App Store.
3. После установки запускайте приложение и видите приветственный экран; нажмите «Начать работу».
4. Выберите способ настройки кошелька: импортировать существующий аккаунт или создать новый.
5. Если подключается новый кошелек MetaMask, придумайте пароль и запомните секретную фразу (SEED-фразу).
6. Интерфейс мобильного приложения мало чем отличается от расширения; в нем реализован тот же функционал.

Теперь вы готовы использовать свой кошелек MetaMask как в браузере, так и на мобильном устройстве!
"""]
    },
    {
      "category": "Установка и настройка",
      "title": "Как создать новый кошелек?",
      "content": ["""
Создание нового кошелька в MetaMask — это важный шаг для управления вашими криптовалютами. Следуйте этой инструкции, чтобы создать новый кошелек и установить пароль, а также сгенерировать Seed-фразу.

1. Установите расширение MetaMask для вашего браузера или загрузите мобильное приложение из Google Play или App Store.
2. Откройте MetaMask, нажав на значок расширения в браузере или запустив приложение на мобильном устройстве.
3. На приветственном экране выберите опцию «Начать работу».
4. Появится окно с двумя вариантами: «Импортировать кошелек» и «Создать кошелек». Выберите «Создать кошелек».
5. Прочитайте условия использования и нажмите «Я согласен», чтобы продолжить.
6. На следующем экране вам будет предложено создать пароль для вашего кошелька. Убедитесь, что пароль состоит минимум из 8 символов и включает буквы, цифры и специальные символы.
7. Введите свой пароль в соответствующее поле и подтвердите его, введя его повторно.
8. После установки пароля вы перейдете к экрану, где будет представлена информация о безопасности вашего кошелька. Ознакомьтесь с ней и нажмите «Далее».
9. Теперь MetaMask сгенерирует вашу Seed-фразу — список из 12 случайных слов, который используется для восстановления доступа к вашему кошельку в будущем. Это очень важный шаг!
10. Запишите Seed-фразу на бумаге и храните ее в безопасном месте. Не храните ее в цифровом формате или в облаке, чтобы избежать кражи.
11. После того как вы записали Seed-фразу, нажмите «Далее», чтобы продолжить.
12. Вам будет предложено подтвердить свою Seed-фразу, введя слова в правильной последовательности. Это необходимо для подтверждения того, что вы действительно сохранили фразу.
13. После успешного подтверждения Seed-фразы вы увидите сообщение о том, что ваш кошелек успешно создан.
14. Поздравляем! Теперь ваш новый кошелек готов к использованию, и вы можете начать управлять своими криптовалютами через MetaMask.

"""]
    },
    {
      "category": "Установка и настройка",
      "title": "Как восстановить доступ к кошельку?",
      "content": ["""
Если у вас уже есть существующий кошелек MetaMask, вы можете импортировать его на другое устройство, используя Seed-фразу:

Seed-фраза — это уникальный набор из 12 слов, который используется для восстановления доступа к вашему кошельку MetaMask. Если вы потеряли доступ к своему кошельку, следуйте этой инструкции для его восстановления:

1. Установите расширение MetaMask для вашего браузера или загрузите мобильное приложение из Google Play или App Store.
2. Откройте MetaMask и на приветственном экране выберите опцию «Импорт кошелька».
3. Вам будет предложено ввести вашу Seed-фразу. Введите 12 слов в правильной последовательности.
4. После ввода Seed-фразы вам нужно будет создать новый пароль для доступа к кошельку.
5. Введите новый пароль в соответствующие поля и подтвердите его.
6. Нажмите кнопку «Импорт» или «Восстановить», чтобы завершить процесс.
7. Поздравляем! Теперь вы можете получить доступ к своему кошельку и управлять своими активами.

Важно помнить, что Seed-фраза является единственным способом восстановления доступа к вашему кошельку, поэтому храните ее в безопасном месте и не делитесь ею с третьими лицами!
"""]
    },

    {
      "category": "Основные операции с кошельком",
      "title": "Как добавить токены в MetaMask?",
      "content": ["""
Добавление токенов в кошелек MetaMask — это важная функция, позволяющая пользователям управлять своими криптоактивами. Следуйте этой инструкции, чтобы добавить токены в различных сетях.

1. Откройте расширение MetaMask в вашем браузере или мобильное приложение и войдите в свою учетную запись.
2. Переключитесь на нужную сеть, если вы хотите добавить токен в сети, отличной от Ethereum Mainnet. Убедитесь, что сеть уже добавлена в ваш кошелек.
3. Найдите кнопку «Импорт токенов» в нижней части экрана и нажмите на нее.
4. У вас есть несколько вариантов добавления токенов:

   - **Добавление существующего токена**:
     - В появившемся окне используйте панель поиска для нахождения совместимого токена. Введите название или тикер токена, который хотите добавить.
     - Выберите нужный токен из списка и нажмите «Далее».
     - Подтвердите импорт токена, нажав кнопку «Импорт». Новый токен появится в списке активов вашего кошелька.

   - **Добавление пользовательского токена**:
     - Если у вас есть адрес контракта токена, выберите вкладку «Пользовательский токен».
     - Введите адрес контракта в соответствующее поле. Этот адрес можно найти на криптобирже или в обозревателе блокчейна.
     - После ввода адреса остальные поля (название и символ токена) заполнятся автоматически. Убедитесь, что количество десятичных знаков указано правильно.
     - Нажмите «Добавить» и подтвердите импорт.

   - **Добавление токена через обозреватель блоков**:
     - Зайдите на сайт обозревателя блоков (например, Etherscan для Ethereum или BscScan для Binance Smart Chain).
     - Найдите нужный токен и скопируйте его адрес контракта.
     - Вернитесь в MetaMask, нажмите «Импорт токенов», вставьте адрес контракта и подтвердите добавление.

   - **Добавление через агрегаторы данных**:
     - Перейдите на CoinMarketCap или другой агрегатор данных.
     - Найдите нужный токен и скопируйте его адрес контракта.
     - В MetaMask нажмите «Импорт токенов», вставьте адрес контракта и подтвердите добавление.

5. После завершения всех шагов новый токен должен появиться в списке активов вашего кошелька MetaMask.

Важно помнить о рисках при добавлении новых токенов: убедитесь, что вы используете правильные адреса контрактов, чтобы избежать мошенничества с вредоносными монетами. Если у вас возникли сомнения по поводу безопасности, лучше провести дополнительное исследование перед добавлением нового токена.
"""]
    },
    {
      "category": "Основные операции с кошельком",
      "title": "Как добавить новые сети в MetaMask?",
      "content": ["""
Добавление сетей в MetaMask позволяет пользователям управлять различными активами и взаимодействовать с децентрализованными приложениями (dApps) на разных блокчейнах. Существует несколько способов добавления сетей в MetaMask: ручное добавление, использование блокчейн-обозревателей и автоматическое добавление через сервис Chainlist.

Ручное добавление сети

1. Откройте ваше расширение MetaMask в браузере.
2. Нажмите на выпадающее меню сетей в верхней части окна.
3. Внизу списка выберите кнопку «Добавить сеть».
4. В открывшемся окне введите параметры сети:
   - Имя сети: название сети, которую вы хотите добавить.
   - Новый URL RPC: адрес сети.
   - Идентификатор цепочки: цифровой идентификатор сети.
   - Символ валюты: обозначение криптовалюты, используемой в этой сети.
   - URL-адрес проводника блока: адрес сканера блоков для этой сети.
5. После ввода всех данных нажмите кнопку «Сохранить». Теперь новая сеть будет доступна в вашем кошельке.

Использование блокчейн-обозревателей

1. Перейдите на сайт обозревателя блоков интересующей вас сети (например, Etherscan для Ethereum или BscScan для Binance Smart Chain).
2. Найдите кнопку «Добавить сеть» с иконкой MetaMask.
3. Нажмите на эту кнопку, и появится окно MetaMask с запросом на подключение.
4. Введите пароль от вашего кошелька и подтвердите разрешение на добавление новой сети.
5. После этого сеть будет добавлена, и вы сможете переключаться между сетями.

Использование Chainlist для автоматического добавления сетей

Chainlist — это удобный сервис, который позволяет быстро добавлять сети в MetaMask без необходимости вручную вводить параметры.

1. Перейдите на сайт Chainlist по адресу https://chainlist.org.
2. Нажмите кнопку «Connect Wallet» в правом верхнем углу, чтобы подключить ваш кошелек MetaMask.
3. Выберите адрес кошелька и подтвердите подключение.
4. Используйте строку поиска, чтобы найти нужную сеть или просмотрите доступные сети в списке.
5. Когда найдете нужную сеть, нажмите кнопку «Add to MetaMask».
6. Подтвердите добавление сети в появившемся окне MetaMask, нажав «Одобрить».
7. Разрешите переключение на новую сеть, и вы сможете начать использовать ее.

Важно: всегда проверяйте параметры сети из официальных источников перед добавлением, чтобы избежать мошенничества с фальшивыми сетями!
"""]
    },
    {
      "category": "Работа с криптовалютой",
      "title": "Как пополнить MetaMask?",
      "content": ["""
Пополнение кошелька MetaMask — это важный процесс, позволяющий пользователям управлять своими криптовалютами. Существует несколько способов пополнения, включая использование банковских карт, обменников и других методов. Рассмотрим способы пополнения.

1. **Пополнение с банковской карты**:
   - Важно отметить, что данный способ не доступен жителям Российской Федерации из-за ограничений, связанных с санкциями и блокировками.
   - Для пользователей из других регионов процесс пополнения с банковской карты осуществляется через сторонние платформы, такие как MoonPay или Transak. 
   - Следуйте инструкциям на экране:
     - Введите сумму, которую хотите купить (например, USDT или ETH).
     - Введите данные своей банковской карты (номер карты, срок действия и CVV).
     - Пройдите процедуру KYC (Know Your Customer), если это требуется.
   - Подтвердите транзакцию. После завершения процесса токены появятся на вашем кошельке.

2. **Пополнение через обменники**:
   - Используйте проверенные обменники для покупки криптовалюты за фиатные деньги. Рекомендуется воспользоваться сервисами мониторинга обменников, такими как BestChange или CoinMarketCap.
   - На сайте мониторинга выберите способ оплаты (например, банковский перевод или электронные деньги) и криптовалюту, которую хотите получить (например, USDT или ETH).
   - Найдите подходящий обменник и следуйте его инструкциям:
     - Введите адрес вашего кошелька MetaMask для получения токенов.
     - Укажите сумму перевода и нажмите «Обменять».
     - Переведите деньги на указанный номер карты или используйте другой предложенный способ оплаты.
     - После подтверждения платежа токены будут отправлены на ваш кошелек MetaMask.

3. **Пополнение через P2P-обмен**:
   - Зайдите на P2P-биржу (например, Binance или LocalBitcoins) и найдите предложения по покупке криптовалюты за фиатные деньги.
   - Выберите продавца с хорошей репутацией и нажмите «Купить».
   - Следуйте инструкциям для перевода денег на банковскую карту продавца или используйте другие доступные способы оплаты.
   - После подтверждения платежа криптовалюта будет автоматически переведена на ваш аккаунт на бирже.
   - Затем вы можете вывести токены на свой кошелек MetaMask, используя адрес вашего кошелька.

4. **Перевод с криптовалютной биржи**:
   - Если у вас уже есть криптовалюта на бирже, вы можете просто вывести ее на свой кошелек MetaMask.
   - Скопируйте адрес своего кошелька из MetaMask и вставьте его в поле вывода на бирже.
   - Убедитесь, что выбрана правильная сеть для перевода (например, ERC-20 для Ethereum).
   - Подтвердите транзакцию. Токены поступят на ваш кошелек после завершения обработки.

5. **Использование электронных денег**:
   - Некоторые пользователи могут использовать электронные платежные системы (например, PayPal, Qiwi или Яндекс.Деньги) для покупки криптовалюты через обменники или P2P-сервисы.
   - Найдите обменник, который поддерживает вашу электронную платежную систему и следуйте инструкциям для завершения транзакции.

Важно помнить о рисках при использовании обменников и P2P-сервисов: всегда проверяйте репутацию обменников и продавцов, чтобы избежать мошенничества!
"""]
    },
    {
      "category": "Работа с криптовалютой",
      "title": "Как отправить криптовалюту из MetaMask?",
      "content": ["""          
1. Откройте расширение MetaMask в вашем браузере или мобильное приложение и войдите в свою учетную запись.
2. Убедитесь, что правильно выбрали желаемую сеть, в которой находятся токены, которые вы хотите отправить. Это можно сделать, нажав на выпадающее меню сетей в верхней части окна.
3. Нажмите кнопку «Отправить» (или «Send»).
4. Введите адрес получателя, на который хотите отправить токены. Убедитесь, что сеть получателя совпадает с Вашей сетью отправителя и адрес введен правильно, так как транзакции в блокчейне необратимы.
5. Выберите токен, который хотите отправить, из выпадающего списка доступных токенов.
6. Введите желаемое количество токенов для отправки.
7. Нажмите кнопку «Далее» (или «Next»), чтобы перейти к следующему шагу.
8. На этом этапе кошелек покажет информацию о стоимости транзакции и комиссионных сборах (газе). Убедитесь, что все данные верны, особенно адрес получателя и количество отправляемых токенов.
9. Нажмите кнопку «Подтвердить» (или «Confirm»), чтобы завершить процесс отправки.
10. После отправки вы вернетесь на главную страницу кошелька. Во вкладке «Активность» вы можете отслеживать процесс транзакции и историю переводов.

Иногда подтверждение транзакции может занять время из-за большой нагрузки сети. В таком случае вы можете использовать функцию «Ускорить» (или «Speed Up») перевод, заплатив дополнительную комиссию.

Важно: всегда проверяйте адрес получателя и сумму перед подтверждением транзакции, чтобы избежать потери средств!
"""]
    },
    {
      "category": "Работа с криптовалютой",
      "title": "Как получать криптовалюту на свой кошелек?",
      "content": ["""
Получение криптовалюты на ваш кошелек MetaMask — это простой процесс, который позволяет вам принимать токены от других пользователей или сервисов. Следуйте этой инструкции, чтобы успешно получить криптовалюту.

1. **Скопируйте адрес вашего кошелька**:
   - Откройте расширение MetaMask в вашем браузере или мобильное приложение и войдите в свою учетную запись.
   - Убедитесь, что вы находитесь в нужной сети (например, Ethereum Mainnet).
   - Нажмите на ваш адрес кошелька в верхней части окна, чтобы скопировать его в буфер обмена. Адрес будет выглядеть как длинная строка символов, начинающаяся с "0x".

2. **Передайте адрес получателю**:
   - Отправьте скопированный адрес другому пользователю или сервису, откуда вы ожидаете получить криптовалюту. Убедитесь, что получатель правильно скопировал адрес, так как транзакции в блокчейне необратимы.

3. **Получение криптовалюты**:
   - Если вы получаете токены от другого пользователя, он должен отправить их на ваш адрес. В зависимости от сети и загруженности блокчейна, процесс может занять некоторое время.
   - Если вы пополняете свой кошелек через обменник или биржу, выберите опцию вывода средств и вставьте адрес вашего кошелька MetaMask как адрес получателя. Убедитесь, что выбрана правильная сеть для перевода.

4. **Отслеживание транзакции**:
   - После отправки криптовалюты вы можете отслеживать статус транзакции через блокчейн-эксплорер (например, Etherscan для Ethereum). Вам понадобится TXID (идентификатор транзакции), который обычно предоставляется отправителем или биржей.

5. **Проверка поступления средств**:
   - После подтверждения транзакции вы увидите поступившие средства в своем кошельке MetaMask. Обновите страницу или приложение, чтобы отобразить новые токены.

Важно помнить: всегда проверяйте правильность адреса перед отправкой средств и используйте только надежные источники для получения криптовалюты!
"""]
    },
    {
      "category": "Продвинутые функции и возможности",
      "title": "Как использовать MetaMask в DeFi-приложениях??",
      "content": ["""

MetaMask является удобным инструментом для взаимодействия с децентрализованными приложениями (DApps) на различных блокчейнах. Следуйте этой инструкции, чтобы подключиться к DApps с помощью MetaMask.

1. **Установка MetaMask**:
   - Убедитесь, что у вас установлено расширение MetaMask для браузера или мобильное приложение. Если вы еще не установили его, перейдите на официальный сайт MetaMask и следуйте инструкциям по установке.

2. **Открытие DApp**:
   - Найдите DApp, к которому хотите подключиться. Это можно сделать через поисковую систему или перейдя на сайт проекта напрямую.

3. **Подключение MetaMask**:
   - На сайте DApp найдите кнопку или ссылку, которая предлагает подключить кошелек. Обычно это кнопка «Connect Wallet» или «Connect MetaMask».
   - Нажмите на эту кнопку. MetaMask автоматически откроется в новом окне или всплывающем окне.
   - Выберите аккаунт, который хотите использовать для подключения к DApp.
   - Подтвердите подключение, нажав на кнопку «Connect».

4. **Проверка доступа**:
   - После подключения вы увидите уведомление о том, что ваш кошелек успешно подключен к DApp. Теперь вы можете использовать функции приложения, такие как обмен токенов, участие в DeFi-проектах и другие операции.

5. **Настройка разрешений**:
   - При первом подключении DApp может запросить доступ к вашим аккаунтам и сетям. Вы можете настроить разрешения, выбрав нужные аккаунты и сети, которые DApp сможет использовать.

6. **Решение возможных проблем**:
   - Если вы столкнулись с проблемами при подключении:
     - Убедитесь, что у вас установлена последняя версия MetaMask.
     - Проверьте, поддерживает ли DApp ту же блокчейн-сеть, что и ваш кошелек.
     - Очистите кэш и куки браузера.
     - Попробуйте отключить и снова включить расширение MetaMask.

7. **Использование Chainlist для автоматического добавления сетей**:
   - Если вам нужно добавить новую сеть в MetaMask для работы с определенным DApp, вы можете использовать сервис Chainlist.
   - Перейдите на сайт Chainlist (https://chainlist.org).
   - Нажмите кнопку «Подключить кошелек», выберите нужный аккаунт и подтвердите подключение.
   - Найдите нужную сеть в списке и нажмите «Add to MetaMask», чтобы автоматически добавить сеть в ваш кошелек.

MetaMask предоставляет безопасный и удобный способ взаимодействия с DApps, позволяя пользователям легко управлять своими активами и участвовать в различных блокчейн-проектах.
"""]
    },
    {
      "category": "Продвинутые функции и возможности",
      "title": "Как переводить токены между сетями?",
      "content": ["""
Перевод токенов между сетями в MetaMask может быть выполнен с помощью мостов (bridges) или децентрализованных обменников. Следуйте этой инструкции, чтобы успешно перевести токены из одной сети в другую.

1. **Выбор моста**:
   - Найдите надежный мост (например, AnySwap, Binance Bridge или Avalanche Bridge), который поддерживает перевод токенов между нужными вам сетями.
   - Перейдите на сайт выбранного моста.

2. **Подключите MetaMask**:
   - На сайте моста найдите кнопку «Подключить кошелек» и выберите MetaMask.
   - Подтвердите подключение вашего кошелька, введя пароль, если это необходимо.

3. **Выбор токенов и сетей**:
   - Выберите исходную сеть (например, Ethereum) и целевую сеть (например, Binance Smart Chain) из выпадающих списков.
   - Убедитесь, что вы выбрали правильные сети для перевода токенов.

4. **Выбор токена для перевода**:
   - Выберите токен, который хотите перевести, из списка доступных токенов.
   - Укажите сумму токенов для перевода.

5. **Подтверждение транзакции**:
   - После ввода всех данных нажмите кнопку «Перевести» или аналогичную.
   - Подтвердите транзакцию в MetaMask, проверив детали (адреса, сумму и комиссии).

6. **Ожидание завершения транзакции**:
   - После подтверждения транзакции вам нужно будет подождать некоторое время, пока перевод будет обработан. Это может занять от нескольких минут до более длительного времени в зависимости от загруженности сети.

7. **Проверка поступления средств**:
   - После завершения процесса перевода проверьте ваш кошелек MetaMask в целевой сети. Если вы не видите токены, убедитесь, что вы находитесь в правильной сети и добавьте пользовательский токен, если это необходимо.

Важно помнить о рисках при использовании мостов: всегда проверяйте адреса и детали транзакций перед их подтверждением. Используйте только надежные мости и будьте осторожны с переводом средств!
"""]
    },
    {
      "category": "Часто задаваемые вопросы (FAQ)",
      "title": "Как установить MetaMask?",
      "content": []
    }

]

